In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('imdb.csv')

In [5]:
df.head()

   id                                       name   genre  year imdb_rating
0   1                                     Avatar  action  2009         7.9
1   2                             Jurassic World  action  2015         7.3
2   3                               The Avengers  action  2012         8.1
3   4                            The Dark Knight  action  2008         9.0
4   5  Star Wars: Episode I - The Phantom Menace  action  1999         6.6

In [6]:
#df.columns.comand
#comandos: mean, median, std, max, count, unique, nunique
df.year.median()

2005.5

In [7]:
#ocurrencias unicas
df.year.nunique()

42

In [8]:
#lista de courrncias unicas
df.year.unique()

array([2009, 2015, 2012, 2008, 1999, 1977, 2006, 2013, 2002, 2005, 2004,
       2011, 2014, 2007, 2010, 1983, 1996, 2003, 1980, 1989, 1984, 1997,
       2001, 1990, 2000, 1993, 1992, 1985, 1994, 1978, 1979, 1986, 1998,
       1991, 1939, 1937, 1982, 1965, 1995, 1975, 1988, 1987], dtype=int64)

In [19]:
df = pd.read_csv('orders.csv')
print(orders.head())

      id first_name    last_name                      email     shoe_type  \
0  41874       Kyle         Peck       KylePeck71@gmail.com  ballet flats
1  31349  Elizabeth    Velazquez   EVelazquez1971@gmail.com         boots
2  43416      Keith     Saunders           KS4047@gmail.com       sandles
3  56054       Ryan      Sweeney  RyanSweeney14@outlook.com       sandles
4  77402      Donna  Blankenship           DB3807@gmail.com     stilettos

  shoe_material shoe_color  price
0  faux-leather      black  385.0
1        fabric      brown  388.0
2       leather       navy  346.0
3        fabric      brown  344.0
4        fabric      brown  289.0

In [20]:
most_expensive = df.price.max()
print(most_expensive)

493.0

In [21]:
nun_colors = df.shoe_color.nunique()
nun_colors

5

In [23]:
colors = df.shoe_color.unique()
colors

array(['black', 'brown', 'navy', 'white', 'red'], dtype=object)

In [24]:
#df.groupby('columns1(resultado)').columns2(filtro).measurement
import pandas as pd
pricey_shoes = df.groupby('shoe_type').price.max()
pricey_shoes

shoe_type
ballet flats    481.0
boots           478.0
clogs           493.0
sandles         456.0
stilettos       487.0
wedges          461.0
Name: price, dtype: float64

In [25]:
#para convertir el anterior codigo e dataframe
#df.groupby('columns1(resultado)').columns2(filtro).measurement.reset_index()

In [26]:
#df.groupby('columns1(resultado)').columns2(filtro).apply(lambda x: np.percentile(x,25).reset_index())

In [33]:
import numpy as np
cheap_shoes = df.groupby('shoe_color').price.apply(lambda x: np.percentile(x,25)).reset_index()
cheap_shoes

  shoe_color  price
0      black    NaN
1      brown  193.5
2       navy  205.5
3        red  250.0
4      white  196.0

In [36]:
shoe_count = df.groupby(['shoe_type', 'shoe_color']).id.count().reset_index()
shoe_count

       shoe_type shoe_color  id
0   ballet flats      black   2
1   ballet flats      brown   5
2   ballet flats        red   3
3   ballet flats      white   5
4          boots      black   3
5          boots      brown   5
6          boots       navy   6
7          boots        red   2
8          boots      white   3
9          clogs      black   4
10         clogs      brown   6
11         clogs       navy   1
12         clogs        red   4
13         clogs      white   1
14       sandles      black   1
15       sandles      brown   4
16       sandles       navy   5
17       sandles        red   3
18       sandles      white   4
19     stilettos      black   5
20     stilettos      brown   3
21     stilettos       navy   2
22     stilettos        red   2
23     stilettos      white   2
24        wedges      black   3
25        wedges      brown   4
26        wedges       navy   4
27        wedges        red   5
28        wedges      white   2

In [39]:
#Reorganizar una tabla
#pivot
shoe_count = df.groupby(['shoe_type', 'shoe_color']).id.count().reset_index()
shoe_count_pivot = shoe_count.pivot(columns='shoe_color', index='shoe_type', values='id').reset_index()
shoe_count_pivot

shoe_color     shoe_type  black  brown  navy  red  white
0           ballet flats    2.0    5.0   NaN  3.0    5.0
1                  boots    3.0    5.0   6.0  2.0    3.0
2                  clogs    4.0    6.0   1.0  4.0    1.0
3                sandles    1.0    4.0   5.0  3.0    4.0
4              stilettos    5.0    3.0   2.0  2.0    2.0
5                 wedges    3.0    4.0   4.0  5.0    2.0